How-to-setup-a-Kali-Server.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-14 Sat 16:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-org78e3efc" class="outline-2">
<h2 id="org78e3efc">How to setup a Kali Server</h2>
<div class="outline-text-2" id="text-org78e3efc">
</div>
<div id="outline-container-orgb1a5278" class="outline-3">
<h3 id="orgb1a5278">Install Kali</h3>
<div class="outline-text-3" id="text-orgb1a5278">
<p>
For this guide I've chosen to use the kali-light iso, because I'll be removing the Window Manager and other tools, I'll also only selecting certain programs to install on this build.
Just install the light iso like you would any other instance of kali, keeping the default settings ect.
</p>
</div>
</div>
<div id="outline-container-orgf5d9886" class="outline-3">
<h3 id="orgf5d9886">Initial tweaks</h3>
<div class="outline-text-3" id="text-orgf5d9886">
<p>
Because this will be a server and not a desktop I'll remove the Window Manager, enable ssh login for root, and having ssh start on boot.
</p>

<p>
First permit root with ssh access 
</p>
<pre class="example">
sed -i "s/^#\PermitRootLogin.*/PermitRootLogin yes/g" /etc/ssh/sshd_config
</pre>

<p>
Next enable ssh at boot
</p>
<div class="org-src-container">
<pre class="src src-shell">systemctl enable ssh
</pre>
</div>

<p>
Finally remove the Window Manager
</p>
<div class="org-src-container">
<pre class="src src-shell">apt update &amp;&amp; apt purge kali-desktop-common kali-desktop-live kali-desktop-xfce xfce4 xfce4-* -y &amp;&amp; apt autoremove -y
</pre>
</div>

<p>
Right after that is done, lets reboot
</p>
</div>
</div>

<div id="outline-container-org8d75fdb" class="outline-3">
<h3 id="org8d75fdb">Interface issue</h3>
<div class="outline-text-3" id="text-org8d75fdb">
<p>
Because we have removed the Window Manager the interface settings may not be correct anymore to fix find the interface name with <code>ip a</code> and edit the <code>/etc/network/interfaces</code> file, adding the interface in.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">echo</span> -e <span style="font-style: italic;">"auto ens32\niface ens32 inet dhcp"</span> &gt;&gt; /etc/network/interfaces
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a80a1e" class="outline-3">
<h3 id="org2a80a1e">SSH tweaks</h3>
<div class="outline-text-3" id="text-org2a80a1e">
<p>
For this setup i don't want to have to use a password, i want to use my SSH keys. 
</p>

<p>
First copy your ssh keys to the server
</p>
<div class="org-src-container">
<pre class="src src-shell">ssh-copy-id root@server-ip
</pre>
</div>

<p>
Next don't allow password auth, change to the following settings in <code>/etc/ssh/sshd_config</code>
</p>
<pre class="example">
PubkeyAuthentication yes
PasswordAuthentication no
</pre>
</div>
</div>

<div id="outline-container-orga77bc83" class="outline-3">
<h3 id="orga77bc83">Install tools</h3>
<div class="outline-text-3" id="text-orga77bc83">
</div>
<div id="outline-container-org98a5f48" class="outline-4">
<h4 id="org98a5f48">Comforts</h4>
<div class="outline-text-4" id="text-org98a5f48">
<div class="org-src-container">
<pre class="src src-shell">apt update &amp;&amp; apt install zsh tmux fortunes git  -y
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc637619" class="outline-4">
<h4 id="orgc637619">zsh configuration</h4>
<div class="outline-text-4" id="text-orgc637619">
<div class="org-src-container">
<pre class="src src-shell">git clone --recursive https://github.com/sorin-ionescu/prezto.git <span style="font-style: italic;">"${ZDOTDIR:-$HOME}/.zprezto"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">setopt</span> EXTENDED_GLOB
<span style="font-weight: bold;">for</span> rcfile<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${ZDOTDIR:-$HOME}"</span>/.zprezto/runcoms/^README.md(.N); <span style="font-weight: bold;">do</span>
  ln -s <span style="font-style: italic;">"$rcfile"</span> <span style="font-style: italic;">"${ZDOTDIR:-$HOME}/.${rcfile:t}"</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">chsh -s /bin/zsh
</pre>
</div>
</div>
</div>

<div id="outline-container-org579ac11" class="outline-4">
<h4 id="org579ac11">Kali tools</h4>
<div class="outline-text-4" id="text-org579ac11">
<div class="org-src-container">
<pre class="src src-shell">apt update &amp;&amp; apt upgrade -y &amp;&amp; apt install kali-linux-web -y
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadac383" class="outline-4">
<h4 id="orgadac383">External tools</h4>
<div class="outline-text-4" id="text-orgadac383">
<p>
I'm not going to tell you how to set up your own server, for me all external tools go in <code>/opt</code> and i use the following script to get updates
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span>
apt-get -qq update &amp;&amp; <span style="font-style: italic;">\</span>
    apt-get -qq -y upgrade &amp;&amp; <span style="font-style: italic;">\</span>
    apt-get -qq autoremove -y
<span style="font-weight: bold;">for</span> dir<span style="font-weight: bold;"> in</span> $(ls /opt); <span style="font-weight: bold;">do</span>
    <span style="font-weight: bold;">cd</span> /opt/$<span style="font-weight: bold; font-style: italic;">dir</span>
    git pull
<span style="font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org03ae01b" class="outline-3">
<h3 id="org03ae01b">Cleanup</h3>
<div class="outline-text-3" id="text-org03ae01b">
<p>
We don't need all the Window Manager stuff anymore, I'm going to remove it 
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">cd</span> &amp;&amp; rm -r Desktop  Documents  Downloads  Music  Pictures  Public  Templates  Videos
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">passwd -l root
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
